export const imageDatas = [
  {
    'fileName': '1.jpg',
    'title': '笑的好傻',
    'desc': '印象中第一次宝宝和我说话就是这样笑的,“Hello,爽爽”,“Hi～～”。这样我们就有了第一次对话'
  },
  {
    'fileName': '2.jpg',
    'title': '孩子王',
    'desc': '哈哈哈，这张你笑的更傻,在孩子中间的你更加天真烂漫。还记得小辣椒吗？我记得给你俩拍过照，但找不到了'
  },
  {
    'fileName': '3.jpg',
    'title': '魏老师',
    'desc': '魏老师上课的样子好认真,支教那段时间虽然很辛苦,但大家都很开心。最重要的是在那认识了宝宝'
  },
  {
    'fileName': '4.jpg',
    'title': '饿急眼了',
    'desc': '这是在豆子的最后一天,我好像哭了。在豆子的每个夜晚我们都在天台聊天,包括2013.7.30的那个凌晨'
  },
  {
    'fileName': '5.jpg',
    'title': '毕业啦',
    'desc': '我们一起毕业啦！我们也一起考上研究生啦！大学四年最大的收获就是和宝宝相识相恋'
  },
  {
    'fileName': '6.jpg',
    'title': '又毕业啦',
    'desc': '这次宝宝先毕业啦,那天还下着小雨呢,宝宝从此就步入了另一个人生阶段啦！放心,宝宝的每个阶段都会有我'
  },
  {
    'fileName': '7.jpg',
    'title': '阶梯教室',
    'desc': '是不是瞬间涌出很多回忆呀,让宝宝头疼的高数题,每天来的最早的娇娇,几乎看不到的洋洋,越涨越丑的小黑狗,每天都走几遍的羊肠小道,还有肉圆...'
  },
  {
    'fileName': '8.jpg',
    'title': '你和你的男朋友',
    'desc': '我们的毕业旅行呀,烧仙草,鼓浪屿,户部巷,热干面,还有讨厌的武大柳絮...'
  },
  {
    'fileName': '9.jpg',
    'title': '我们的脚印',
    'desc': '在一起6年多啦,本科,考研,研究生,工作...我们一步一个脚印的走过来,我们也越来越幸福！'
  },
  {
    'fileName': '10.jpg',
    'title': '傻子二人组',
    'desc': '虽然穷游,但是我们好开心呀,一起吹海风,一起听海浪拍打沙滩,一起四处溜达,一起傻笑...'
  },
  {
    'fileName': '11.jpg',
    'title': '纪念日的午餐',
    'desc': '知道这是哪次吃饭吗？哈哈,这是来北京的第一个纪念日,在朝阳吃的东南亚菜。和宝宝在一起吃了好多没吃过的东西,纪念日的东南亚菜,宝宝生日的韩国料理,我生日的日本料理'
  },
  {
    'fileName': '12.jpg',
    'title': '我们的二月',
    'desc': '我们工作后的小宝贝呀,刚来那会儿好可爱呀,虽然现在又丑又胖又不听话,但宝宝还是爱他的呀,他会一直陪着我们的吧'
  },
  {
    'fileName': '13.jpg',
    'title': '试衣服啦',
    'desc': '哈哈哈,宝宝一定不知道这张图片的故事吧,“这件好看吗？”,“哪件好看？”,“这件打几分？”,“好看在哪？”,“不好看在哪？”'
  },
  {
    'fileName': '14.jpg',
    'title': '哈哈哈哈',
    'desc': '手机里有好多宝宝这种傻里傻气的照片。宝宝经常拿手机不知道干嘛,说话不经过脑子(抽酒喝烟,哈哈),腿上各种淤青...太傻啦,傻的可爱'
  },
  {
    'fileName': '15.jpg',
    'title': '香港！香港！',
    'desc': '宝宝最爱的香港呀,铜锣湾,海港城,万宁,大澳渔村,SASA,车仔面,迪士尼......那天坐了八次矿车,第二次去还坐了过山车,咱以后少坐几次吧'
  },
  {
    'fileName': '16.jpg',
    'title': '跳跳跳',
    'desc': '厦门那天跳了好多次呀,我们拍照最常用的姿势,毕业照也跳,前几天在故宫也跳,哈哈哈'
  }
]

export function getRangeRandom (low, high) {
  return Math.ceil(Math.random() * (high - low) + low)
}

/*
* 获取 0~30° 之间的一个任意正负值
*/
export function get30DegRandom () {
  return ((Math.random() > 0.5 ? '' : '-') + Math.ceil(Math.random() * 30))
}
